In [2]:
import pandas as pd

In [5]:
import re

In [6]:
import numpy as np

In [7]:
timesData = pd.read_csv("dataframe/timesData.csv")
timesData.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
0,1,Harvard University,United States of America,99.7,72.4,98.7,98.8,34.5,96.1,"20,152",8.9,25%,NaN,2011
1,2,California Institute of Technology,United States of America,97.7,54.6,98.0,99.9,83.7,96.0,"2,243",6.9,27%,33 : 67,2011
2,3,Massachusetts Institute of Technology,United States of America,97.8,82.3,91.4,99.9,87.5,95.6,"11,074",9.0,33%,37 : 63,2011
3,4,Stanford University,United States of America,98.3,29.5,98.1,99.2,64.3,94.3,"15,596",7.8,22%,42 : 58,2011
4,5,Princeton University,United States of America,90.9,70.3,95.4,99.9,-,94.2,"7,929",8.4,27%,45 : 55,2011

In [8]:
timesData.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2603 entries, 0 to 2602
Data columns (total 14 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   world_rank              2603 non-null   object
 1   university_name         2603 non-null   object
 2   country                 2603 non-null   object
 3   teaching                2603 non-null   float64
 4   international           2603 non-null   object
 5   research                2603 non-null   float64
 6   citations               2603 non-null   float64
 7   income                  2603 non-null   object
 8   total_score             2603 non-null   object
 9   num_students            2544 non-null   object
 10  student_staff_ratio     2544 non-null   float64
 11  international_students  2536 non-null   object
 12  female_male_ratio       2370 non-null   object
 13  year                    2603 non-null   int64
dtypes: float64(4), int64(1), object(9)
memory usage: 284.8+ KB

In [9]:
timesData['income']=pd.to_numeric(timesData['income'], errors='coerce')

In [10]:
shanghaiData = pd.read_csv("dataframe/shanghaiData.csv")
shanghaiData.head()

,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year
0,1,Harvard University,1,100.0,100.0,100.0,100.0,100.0,100.0,72.4,2005
1,2,University of Cambridge,1,73.6,99.8,93.4,53.3,56.6,70.9,66.9,2005
2,3,Stanford University,2,73.4,41.1,72.2,88.5,70.9,72.3,65.0,2005
3,4,"University of California, Berkeley",3,72.8,71.8,76.0,69.4,73.9,72.2,52.7,2005
4,5,Massachusetts Institute of Technology (MIT),4,70.1,74.0,80.6,66.7,65.8,64.3,53.0,2005

In [11]:
school_and_country = pd.read_csv("dataframe/school_and_country_table.csv")
school_and_country.head()

                             school_name                   country
0                     Harvard University  United States of America
1     California Institute of Technology  United States of America
2  Massachusetts Institute of Technology  United States of America
3                    Stanford University  United States of America
4                   Princeton University  United States of America

In [12]:
cwurData = pd.read_csv("dataframe/cwurData.csv")
cwurData.head()

,world_rank,institution,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
0,1,Harvard University,USA,1,7,9,1,1,1,1,NaN,5,100.00,2012
1,2,Massachusetts Institute of Technology,USA,2,9,17,3,12,4,4,NaN,1,91.67,2012
2,3,Stanford University,USA,3,17,11,5,4,2,2,NaN,15,89.50,2012
3,4,University of Cambridge,United Kingdom,1,10,24,4,16,16,11,NaN,50,86.17,2012
4,5,California Institute of Technology,USA,4,2,29,7,37,22,22,NaN,18,85.21,2012

In [13]:
educational_attainment = pd.read_csv("dataframe/educational_attainment_supplementary_data.csv")
educational_attainment.head()

,country_name,series_name,1985,1986,1987,1990,1991,1992,1993,1995,...,2005,2006,2007,2008,2009,2010,2011,2012,2013,2015
0,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.33,NaN,NaN,0.44,NaN,NaN,NaN,0.57,...,0.86,NaN,NaN,NaN,NaN,1.27,NaN,NaN,NaN,NaN
1,Afghanistan,"Barro-Lee: Average years of primary schooling,...",1.03,NaN,NaN,1.26,NaN,NaN,NaN,1.54,...,2.18,NaN,NaN,NaN,NaN,2.64,NaN,NaN,NaN,NaN
2,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.83,NaN,NaN,0.95,NaN,NaN,NaN,1.26,...,1.01,NaN,NaN,NaN,NaN,2.45,NaN,NaN,NaN,NaN
3,Afghanistan,"Barro-Lee: Average years of primary schooling,...",2.34,NaN,NaN,2.22,NaN,NaN,NaN,2.37,...,2.26,NaN,NaN,NaN,NaN,3.55,NaN,NaN,NaN,NaN
4,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.54,NaN,NaN,0.92,NaN,NaN,NaN,0.94,...,2.00,NaN,NaN,NaN,NaN,1.29,NaN,NaN,NaN,NaN

In [14]:
education_expenditure = pd.read_csv("dataframe/education_expenditure_supplementary_data.csv",engine='python')
education_expenditure.head()

,country,institute_type,direct_expenditure_type,1995,2000,2005,2009,2010,2011
0,OECD Average,All Institutions,Public,4.9,4.9,5.0,5.4,5.4,5.3
1,Australia,All Institutions,Public,4.5,4.6,4.3,4.5,4.6,4.3
2,Austria,All Institutions,Public,5.3,5.4,5.2,5.7,5.6,5.5
3,Belgium,All Institutions,Public,5.0,5.1,5.8,6.4,6.4,6.4
4,Canada,All Institutions,Public,5.8,5.2,4.8,5.0,5.2,NaN

1. For each university, extract from the times dataset the most recent and the least recent data, obtaining two separate dataframe

In [15]:
most_recent_data=timesData.loc[(timesData.groupby('university_name')['year'].idxmax())]
most_recent_data.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
2405,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,NaN,-,"35,569",17.0,1%,-,2016
2003,201-250,Aalborg University,Denmark,25.1,71.0,28.4,73.8,43.7,-,"17,422",15.9,15%,48 : 52,2016
2056,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,-,"16,099",24.2,17%,32 : 68,2016
1908,=106,Aarhus University,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,"23,895",13.6,14%,54 : 46,2016
2105,301-350,Aberystwyth University,United Kingdom,21.6,72.2,18.9,67.2,31.3,-,"9,252",19.2,18%,48 : 52,2016

In [16]:
least_recent_data=timesData.loc[(timesData.groupby('university_name')['year'].idxmin())]
least_recent_data.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
2405,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,NaN,-,"35,569",17.0,1%,-,2016
501,301-350,Aalborg University,Denmark,19.0,75.3,20.0,27.1,36.4,-,"17,422",15.9,15%,48 : 52,2012
502,301-350,Aalto University,Finland,26.2,49.0,22.2,37.5,61.9,-,"16,099",24.2,17%,32 : 68,2012
166,167,Aarhus University,Denmark,38.1,33.4,55.6,57.3,61.5,49.9,"23,895",13.6,14%,54 : 46,2011
476,276-300,Aberystwyth University,United Kingdom,19.8,63.8,15.5,56.6,35.5,-,"9,252",19.2,18%,48 : 52,2012

In [ ]:
##timesData[timesData['year']>=timesData['year'].max()]

In [ ]:
##timesData[timesData['university_name']=='Aalto University']

In [ ]:
#timesData.groupby('university_name').min()['year']

In [ ]:
#timesData.groupby('university_name').max()['year']

2. For each university, compute the improvement in "income" between the least recent and the most recent data points

In [17]:
punto2=pd.merge(most_recent_data, least_recent_data, on='university_name')
punto2.head()

,world_rank_x,university_name,country_x,teaching_x,international_x,research_x,citations_x,income_x,total_score_x,num_students_x,...,international_y,research_y,citations_y,income_y,total_score_y,num_students_y,student_staff_ratio_y,international_students_y,female_male_ratio_y,year_y
0,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,NaN,-,"35,569",...,17.9,3.7,35.7,NaN,-,"35,569",17.0,1%,-,2016
1,201-250,Aalborg University,Denmark,25.1,71.0,28.4,73.8,43.7,-,"17,422",...,75.3,20.0,27.1,36.4,-,"17,422",15.9,15%,48 : 52,2012
2,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,-,"16,099",...,49.0,22.2,37.5,61.9,-,"16,099",24.2,17%,32 : 68,2012
3,=106,Aarhus University,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,"23,895",...,33.4,55.6,57.3,61.5,49.9,"23,895",13.6,14%,54 : 46,2011
4,301-350,Aberystwyth University,United Kingdom,21.6,72.2,18.9,67.2,31.3,-,"9,252",...,63.8,15.5,56.6,35.5,-,"9,252",19.2,18%,48 : 52,2012

In [ ]:
punto2.columns

In [ ]:
##nuovo_punto2=punto2[punto2[['income_x','income_y']].notnull()]
##nuovo_punto2.head()

In [ ]:
##def calcola_perc(riga):
    ##return riga['income_x'] - riga['income_y']

In [ ]:
##nuovo_punto2['income_improvement']=nuovo_punto2.apply(calcola_perc, axis=1)
##nuovo_punto2.head()

In [ ]:
##nuovo_punto2['differenza']=nuovo_punto2['income_x']-nuovo_punto2['income_y']
##nuovo_punto2

In [ ]:
#nuovo_punto2[nuovo_punto2['income_y']-nuovo_punto2['income_x']]

In [ ]:
##lista=nuovo_punto2['income_x']
##lista

In [ ]:
##nuovo=lista.astype(float)
##nuovo

In [ ]:
def calcola_perc(riga):
    return riga['votes_first_vote']/ risultato[riga['state']] *100

In [ ]:
##nuovo_punto2['income_y']=nuovo_punto2['income_y'].to_numeric()

In [ ]:
##nuovo_punto2=np.array(list, dtype=float)

In [18]:
punto2['income_improvement']=punto2['income_y']-punto2['income_x']
punto2.head()

,world_rank_x,university_name,country_x,teaching_x,international_x,research_x,citations_x,income_x,total_score_x,num_students_x,...,research_y,citations_y,income_y,total_score_y,num_students_y,student_staff_ratio_y,international_students_y,female_male_ratio_y,year_y,income_improvement
0,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,NaN,-,"35,569",...,3.7,35.7,NaN,-,"35,569",17.0,1%,-,2016,NaN
1,201-250,Aalborg University,Denmark,25.1,71.0,28.4,73.8,43.7,-,"17,422",...,20.0,27.1,36.4,-,"17,422",15.9,15%,48 : 52,2012,-7.3
2,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,-,"16,099",...,22.2,37.5,61.9,-,"16,099",24.2,17%,32 : 68,2012,0.3
3,=106,Aarhus University,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,"23,895",...,55.6,57.3,61.5,49.9,"23,895",13.6,14%,54 : 46,2011,-6.8
4,301-350,Aberystwyth University,United Kingdom,21.6,72.2,18.9,67.2,31.3,-,"9,252",...,15.5,56.6,35.5,-,"9,252",19.2,18%,48 : 52,2012,4.2

3. Find the university with the largest increase computed in the previous point

In [19]:
punto2.loc[punto2['income_improvement']>= punto2['income_improvement'].max()]['university_name'] #possiamo anche togliere l'ultima quadra

414    State University of New York Albany
Name: university_name, dtype: object

4. For each ranking, consider only the most recent data point. For each university, compute the maximum difference between the rankings (e.g. for Aarhus University the value is 122-73=49). Notice that some rankings are expressed as a range

In [20]:
cwurData[cwurData['institution']=='Aarhus University']

,world_rank,institution,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
318,119,Aarhus University,Denmark,2,292,188,107,90,78,81,90.0,194,50.17,2014
1321,122,Aarhus University,Denmark,2,310,165,106,91,81,101,95.0,154,49.65,2015

In [21]:
shanghaiData[shanghaiData['university_name']=='Aarhus University']

,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year
100,101-152,Aarhus University,2,NaN,15.4,19.3,7.9,22.3,41.6,22.4,2005
601,102-150,Aarhus University,2,NaN,14.8,18.9,7.7,23.8,42.7,24.6,2006
1101,102-150,Aarhus University,2,NaN,14.4,18.9,7.4,24.3,40.8,23.7,2007
1603,93,Aarhus University,2,24.5,13.7,18.9,7.3,24.5,48.2,27.0,2008
2109,97,Aarhus University,2,24.2,13.4,18.9,7.3,24.0,47.6,26.6,2009
2611,98,Aarhus University,2,24.2,13.1,18.9,7.2,23.5,48.4,25.4,2010
3099,86,Aarhus University,2,25.4,13.2,22.1,7.2,24.3,49.3,27.9,2011
3599,86,Aarhus University,2,25.5,12.1,22.8,7.2,23.9,50.8,26.6,2012
3878,81,Aarhus University,2.0,26.0,12.0,22.2,7.2,25.6,50.9,28.5,2013
3970,74,Aarhus University,2,27.4,11.8,22.1,12.3,26.7,51.9,29.8,2014
4469,73,Aarhus University,2,27.3,11.5,22.1,12.3,25.8,51.8,31.0,2015

5. Consider only the most recent data point of the times dataset. Compute the number of male and female students for each country.

In [ ]:
most_recent_data.head()

In [ ]:
most_recent_data['year']

In [ ]:
most_recent_datab

In [ ]:
rapporto=most_recent_data['female_male_ratio']
rapporto.head()

In [ ]:
dataframe=pd.DataFrame(rapporto)
dataframe.head()

In [ ]:
most_recent_data.info()

In [22]:
most_recent_data['female'] = most_recent_data['female_male_ratio'].str.extract(r'(^\d+)')
most_recent_data['male'] = most_recent_data['female_male_ratio'].str.extract(r'(\d+$)')
most_recent_data.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year,female,male
2405,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,NaN,-,"35,569",17.0,1%,-,2016,NaN,NaN
2003,201-250,Aalborg University,Denmark,25.1,71.0,28.4,73.8,43.7,-,"17,422",15.9,15%,48 : 52,2016,48,52
2056,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,-,"16,099",24.2,17%,32 : 68,2016,32,68
1908,=106,Aarhus University,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,"23,895",13.6,14%,54 : 46,2016,54,46
2105,301-350,Aberystwyth University,United Kingdom,21.6,72.2,18.9,67.2,31.3,-,"9,252",19.2,18%,48 : 52,2016,48,52

In [23]:
most_recent_data['male']=pd.to_numeric(most_recent_data['male'], errors='coerce')
most_recent_data['female']=pd.to_numeric(most_recent_data['female'], errors='coerce')

In [24]:
most_recent_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 818 entries, 2405 to 2134
Data columns (total 16 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   world_rank              818 non-null    object
 1   university_name         818 non-null    object
 2   country                 818 non-null    object
 3   teaching                818 non-null    float64
 4   international           818 non-null    object
 5   research                818 non-null    float64
 6   citations               818 non-null    float64
 7   income                  774 non-null    float64
 8   total_score             818 non-null    object
 9   num_students            796 non-null    object
 10  student_staff_ratio     796 non-null    float64
 11  international_students  793 non-null    object
 12  female_male_ratio       742 non-null    object
 13  year                    818 non-null    int64
 14  female                  739 non-null    float64
 15  male                    739 non-null    float64
dtypes: float64(7), int64(1), object(8)
memory usage: 108.6+ KB

In [25]:
most_recent_data['num_students'] = most_recent_data['num_students'].str.replace(',','')
most_recent_data.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year,female,male
2405,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,NaN,-,35569,17.0,1%,-,2016,NaN,NaN
2003,201-250,Aalborg University,Denmark,25.1,71.0,28.4,73.8,43.7,-,17422,15.9,15%,48 : 52,2016,48.0,52.0
2056,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,-,16099,24.2,17%,32 : 68,2016,32.0,68.0
1908,=106,Aarhus University,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,23895,13.6,14%,54 : 46,2016,54.0,46.0
2105,301-350,Aberystwyth University,United Kingdom,21.6,72.2,18.9,67.2,31.3,-,9252,19.2,18%,48 : 52,2016,48.0,52.0

In [26]:
most_recent_data['num_students']=pd.to_numeric(most_recent_data['num_students'], errors='coerce')
most_recent_data.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year,female,male
2405,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,NaN,-,35569.0,17.0,1%,-,2016,NaN,NaN
2003,201-250,Aalborg University,Denmark,25.1,71.0,28.4,73.8,43.7,-,17422.0,15.9,15%,48 : 52,2016,48.0,52.0
2056,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,-,16099.0,24.2,17%,32 : 68,2016,32.0,68.0
1908,=106,Aarhus University,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,23895.0,13.6,14%,54 : 46,2016,54.0,46.0
2105,301-350,Aberystwyth University,United Kingdom,21.6,72.2,18.9,67.2,31.3,-,9252.0,19.2,18%,48 : 52,2016,48.0,52.0

In [ ]:
##def calc_numero(row):
    ##return most_recent_data['num_students']* most_recent_data[row]//100

In [ ]:
#most_recent_data['num_male']=most_recent_data['male'].apply(calc_numero, axis= 1)

In [27]:
most_recent_data['num_male']= most_recent_data['male'] * most_recent_data['num_students'] // 100
most_recent_data.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year,female,male,num_male
2405,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,NaN,-,35569.0,17.0,1%,-,2016,NaN,NaN,NaN
2003,201-250,Aalborg University,Denmark,25.1,71.0,28.4,73.8,43.7,-,17422.0,15.9,15%,48 : 52,2016,48.0,52.0,9059.0
2056,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,-,16099.0,24.2,17%,32 : 68,2016,32.0,68.0,10947.0
1908,=106,Aarhus University,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,23895.0,13.6,14%,54 : 46,2016,54.0,46.0,10991.0
2105,301-350,Aberystwyth University,United Kingdom,21.6,72.2,18.9,67.2,31.3,-,9252.0,19.2,18%,48 : 52,2016,48.0,52.0,4811.0

In [28]:
most_recent_data['num_fem']= most_recent_data['female'] * most_recent_data['num_students'] // 100
most_recent_data.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year,female,male,num_male,num_fem
2405,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,NaN,-,35569.0,17.0,1%,-,2016,NaN,NaN,NaN,NaN
2003,201-250,Aalborg University,Denmark,25.1,71.0,28.4,73.8,43.7,-,17422.0,15.9,15%,48 : 52,2016,48.0,52.0,9059.0,8362.0
2056,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,-,16099.0,24.2,17%,32 : 68,2016,32.0,68.0,10947.0,5151.0
1908,=106,Aarhus University,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,23895.0,13.6,14%,54 : 46,2016,54.0,46.0,10991.0,12903.0
2105,301-350,Aberystwyth University,United Kingdom,21.6,72.2,18.9,67.2,31.3,-,9252.0,19.2,18%,48 : 52,2016,48.0,52.0,4811.0,4440.0

6. Find the universities where the ratio between female and male is below the average ratio (computed over all universities)

In [29]:
most_recent_data['rapporto'] = most_recent_data['num_fem'] / most_recent_data['num_male']
media = most_recent_data['rapporto'].notnull().mean()

In [30]:
punto6 = most_recent_data.loc[most_recent_data['rapporto'] <= media]
punto6.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year,female,male,num_male,num_fem,rapporto
2056,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,-,16099.0,24.2,17%,32 : 68,2016,32.0,68.0,10947.0,5151.0,0.470540
2406,601-800,Ajou University,South Korea,19.5,20.0,11.9,23.9,45.7,-,12706.0,11.3,2%,33 : 67,2016,33.0,67.0,8513.0,4192.0,0.492423
2408,601-800,Alexandria University,Egypt,20.3,33.7,8.2,14.1,29.7,-,127431.0,23.3,1%,46 : 54,2016,46.0,54.0,68812.0,58618.0,0.851857
2410,601-800,Aligarh Muslim University,India,28.3,18.7,10.0,20.9,29.6,-,11197.0,10.5,2%,17 : 83,2016,17.0,83.0,9293.0,1903.0,0.204778
2304,501-600,Amirkabir University of Technology,Iran,24.5,7.7,25.7,34.8,55.7,-,14080.0,25.6,1%,34 : 66,2016,34.0,66.0,9292.0,4787.0,0.515174

In [31]:
punto6['university_name']

2056                            Aalto University
2406                             Ajou University
2408                       Alexandria University
2410                   Aligarh Muslim University
2304          Amirkabir University of Technology
                          ...
2599                 Yıldız Technical University
2104                         Zhejiang University
1856                    École Normale Supérieure
1904                         École Polytechnique
1833    École Polytechnique Fédérale de Lausanne
Name: university_name, Length: 237, dtype: object

7. For each country, compute the fraction of the students in the country that are in one of the universities computed in the previous point (that is, the denominator of the ratio is the total number of students over all universities in the country).

In [87]:
#denominatore
deno = most_recent_data.groupby('country', as_index = True)['num_students'].sum()
#numeratore
deno

country
Argentina                     108373.0
Australia                     743627.0
Austria                       134477.0
Bangladesh                     62716.0
Belarus                        29303.0
                               ...
Unisted States of America          0.0
United Arab Emirates           14447.0
United Kingdom               1324842.0
United States of America     3280303.0
Unted Kingdom                      0.0
Name: num_students, Length: 72, dtype: float64

In [76]:
num=punto6.groupby('country')['num_students'].sum()

In [78]:
num.dtype

dtype('float64')

In [88]:
deno.dtype

dtype('float64')

In [90]:
fraction=num/deno
fraction

country
Argentina                         NaN
Australia                    0.118506
Austria                      0.252541
Bangladesh                   1.000000
Belarus                           NaN
                               ...
Unisted States of America         NaN
United Arab Emirates              NaN
United Kingdom               0.108732
United States of America     0.201878
Unted Kingdom                     NaN
Name: num_students, Length: 72, dtype: float64

In [73]:
#most_recent_data.loc[most_recent_data.groupby('country').sum()['num_students']]

KeyError: "None of [Float64Index([ 108373.0,  743627.0,  134477.0,   62716.0,   29303.0,  169661.0,\n               534688.0,  717054.0,  116026.0, 1285619.0,   54645.0,    6880.0,\n               203321.0,  119355.0,  376189.0,   24330.0,  106165.0,  694221.0,\n               948489.0,   37274.0,  202013.0,   91656.0,  138282.0,   13960.0,\n               191154.0,   43565.0,  138992.0,  107400.0, 1243124.0,  563422.0,\n                60263.0,   72676.0,   15100.0,    7695.0,   19019.0,    5144.0,\n                 8521.0,  161827.0,  151731.0,   56060.0,  225877.0,  125957.0,\n                26247.0,   66541.0,    7089.0,   22496.0,  260882.0,  163890.0,\n                 9583.0,  112309.0,  108378.0,  214008.0,   83453.0,   96968.0,\n                56620.0,   37279.0,   63352.0,  330198.0,  442372.0,  830331.0,\n               187293.0,  130940.0,  308940.0,  210122.0,  639342.0,   37340.0,\n                37096.0,       0.0,   14447.0, 1324842.0, 3280303.0,\n                    0.0],\n             dtype='float64')] are in the [index]"

8. Read the file educational_attainment_supplementary_data.csv, discarding any row with missing country_name or series_name

In [32]:
educational_attainment = pd.read_csv("dataframe/educational_attainment_supplementary_data.csv")
educational_attainment.head()

,country_name,series_name,1985,1986,1987,1990,1991,1992,1993,1995,...,2005,2006,2007,2008,2009,2010,2011,2012,2013,2015
0,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.33,NaN,NaN,0.44,NaN,NaN,NaN,0.57,...,0.86,NaN,NaN,NaN,NaN,1.27,NaN,NaN,NaN,NaN
1,Afghanistan,"Barro-Lee: Average years of primary schooling,...",1.03,NaN,NaN,1.26,NaN,NaN,NaN,1.54,...,2.18,NaN,NaN,NaN,NaN,2.64,NaN,NaN,NaN,NaN
2,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.83,NaN,NaN,0.95,NaN,NaN,NaN,1.26,...,1.01,NaN,NaN,NaN,NaN,2.45,NaN,NaN,NaN,NaN
3,Afghanistan,"Barro-Lee: Average years of primary schooling,...",2.34,NaN,NaN,2.22,NaN,NaN,NaN,2.37,...,2.26,NaN,NaN,NaN,NaN,3.55,NaN,NaN,NaN,NaN
4,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.54,NaN,NaN,0.92,NaN,NaN,NaN,0.94,...,2.00,NaN,NaN,NaN,NaN,1.29,NaN,NaN,NaN,NaN

In [33]:
#educational_attainment.dropna(educational_attainment,how="any", thresh=None, subset=(['country_name','series_name']), inplace=True)
#educational_attainment.head()

In [34]:
educ = educational_attainment[(educational_attainment['country_name'].notnull()) | (educational_attainment['series_name'].notnull())]
educ.head()

,country_name,series_name,1985,1986,1987,1990,1991,1992,1993,1995,...,2005,2006,2007,2008,2009,2010,2011,2012,2013,2015
0,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.33,NaN,NaN,0.44,NaN,NaN,NaN,0.57,...,0.86,NaN,NaN,NaN,NaN,1.27,NaN,NaN,NaN,NaN
1,Afghanistan,"Barro-Lee: Average years of primary schooling,...",1.03,NaN,NaN,1.26,NaN,NaN,NaN,1.54,...,2.18,NaN,NaN,NaN,NaN,2.64,NaN,NaN,NaN,NaN
2,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.83,NaN,NaN,0.95,NaN,NaN,NaN,1.26,...,1.01,NaN,NaN,NaN,NaN,2.45,NaN,NaN,NaN,NaN
3,Afghanistan,"Barro-Lee: Average years of primary schooling,...",2.34,NaN,NaN,2.22,NaN,NaN,NaN,2.37,...,2.26,NaN,NaN,NaN,NaN,3.55,NaN,NaN,NaN,NaN
4,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.54,NaN,NaN,0.92,NaN,NaN,NaN,0.94,...,2.00,NaN,NaN,NaN,NaN,1.29,NaN,NaN,NaN,NaN

In [35]:
#educational_attainment.dropna?

9. From attainment build a dataframe with the same data, but with 4 columns: country_name, series_name, year, value

In [36]:
ed_pulito= educ.dropna(axis='columns', how='all')
ed_pulito.head()

,country_name,series_name,1985,1986,1987,1990,1991,1992,1993,1995,...,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.33,NaN,NaN,0.44,NaN,NaN,NaN,0.57,...,NaN,0.86,NaN,NaN,NaN,NaN,1.27,NaN,NaN,NaN
1,Afghanistan,"Barro-Lee: Average years of primary schooling,...",1.03,NaN,NaN,1.26,NaN,NaN,NaN,1.54,...,NaN,2.18,NaN,NaN,NaN,NaN,2.64,NaN,NaN,NaN
2,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.83,NaN,NaN,0.95,NaN,NaN,NaN,1.26,...,NaN,1.01,NaN,NaN,NaN,NaN,2.45,NaN,NaN,NaN
3,Afghanistan,"Barro-Lee: Average years of primary schooling,...",2.34,NaN,NaN,2.22,NaN,NaN,NaN,2.37,...,NaN,2.26,NaN,NaN,NaN,NaN,3.55,NaN,NaN,NaN
4,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.54,NaN,NaN,0.92,NaN,NaN,NaN,0.94,...,NaN,2.00,NaN,NaN,NaN,NaN,1.29,NaN,NaN,NaN

In [ ]:
#ed_pulito[ed_pulito['1986'].notnull()]

In [70]:
pd.melt?

In [65]:
ed_pulito.columns[2:]

Index(['1985', '1986', '1987', '1990', '1991', '1992', '1993', '1995', '1996',
       '1998', '1999', '2000', '2001', '2002', '2003', '2004', '2005', '2006',
       '2007', '2008', '2009', '2010', '2011', '2012', '2013'],
      dtype='object')

In [72]:
pd.melt(ed_pulito, id_vars=['country_name','series_name'], value_vars=['1985', '1986', '1987', '1990', '1991', '1992', '1993', '1995', '1996',
       '1998', '1999', '2000', '2001', '2002', '2003', '2004', '2005', '2006',
       '2007', '2008', '2009', '2010', '2011', '2012', '2013'])

,country_name,series_name,variable,value
0,Afghanistan,"Barro-Lee: Average years of primary schooling,...",1985,0.33
1,Afghanistan,"Barro-Lee: Average years of primary schooling,...",1985,1.03
2,Afghanistan,"Barro-Lee: Average years of primary schooling,...",1985,0.83
3,Afghanistan,"Barro-Lee: Average years of primary schooling,...",1985,2.34
4,Afghanistan,"Barro-Lee: Average years of primary schooling,...",1985,0.54
...,...,...,...,...
1976295,Zimbabwe,UIS: Percentage of population age 25+ with unk...,2013,NaN
1976296,Zimbabwe,UIS: Percentage of population age 25+ with unk...,2013,NaN
1976297,Zimbabwe,UIS: Percentage of population age 25+ with unk...,2013,NaN
1976298,Data from database: Education Statistics: Educ...,NaN,2013,NaN
1976299,Last Updated: 10/20/2015,NaN,2013,NaN

Index(['1985', '1986', '1987', '1990', '1991', '1992', '1993', '1995', '1996',
       '1998', '1999', '2000', '2001', '2002', '2003', '2004', '2005', '2006',
       '2007', '2008', '2009', '2010', '2011', '2012', '2013'],
      dtype='object')

In [ ]:
ed_pulito.transpose?

10. For each university, find the number of rankings in which they appear (it suffices to appear in one year for each ranking).

In [98]:
tab=pd.merge(timesData, shanghaiData, on='university_name')
tab_merge=pd.merge(tab, cwurData, left_on='university_name', right_on='institution')
tab_merge

,world_rank_x,university_name,country_x,teaching,international,research,citations_x,income,total_score_x,num_students,...,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations_y,broad_impact,patents,score,year
0,1,Harvard University,United States of America,99.7,72.4,98.7,98.8,34.5,96.1,"20,152",...,7,9,1,1,1,1,NaN,5,100.00,2012
1,1,Harvard University,United States of America,99.7,72.4,98.7,98.8,34.5,96.1,"20,152",...,1,1,1,1,1,1,NaN,7,100.00,2013
2,1,Harvard University,United States of America,99.7,72.4,98.7,98.8,34.5,96.1,"20,152",...,1,1,1,1,1,1,1.0,2,100.00,2014
3,1,Harvard University,United States of America,99.7,72.4,98.7,98.8,34.5,96.1,"20,152",...,1,1,1,1,1,1,1.0,3,100.00,2015
4,1,Harvard University,United States of America,99.7,72.4,98.7,98.8,34.5,96.1,"20,152",...,7,9,1,1,1,1,NaN,5,100.00,2012
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
33173,601-800,University of Tehran,Iran,26.1,16.5,16.9,15.8,NaN,-,"53,802",...,181,567,218,489,984,812,770.0,871,44.28,2015
33174,601-800,University of Tehran,Iran,26.1,16.5,16.9,15.8,NaN,-,"53,802",...,171,478,210,519,974,800,769.0,737,44.58,2014
33175,601-800,University of Tehran,Iran,26.1,16.5,16.9,15.8,NaN,-,"53,802",...,181,567,218,489,984,812,770.0,871,44.28,2015
33176,601-800,Tokyo University of Science,Japan,23.0,15.4,24.1,21.4,37.6,-,"20,243",...,355,478,210,504,516,406,402.0,128,45.48,2014
33177,601-800,Tokyo University of Science,Japan,23.0,15.4,24.1,21.4,37.6,-,"20,243",...,367,567,218,530,530,428,457.0,191,44.84,2015

In [99]:
tab

,world_rank_x,university_name,country,teaching,international,research,citations,income,total_score_x,num_students,...,world_rank_y,national_rank,total_score_y,alumni,award,hici,ns,pub,pcp,year_y
0,1,Harvard University,United States of America,99.7,72.4,98.7,98.8,34.5,96.1,"20,152",...,1,1,100.0,100.0,100.0,100.0,100.0,100.0,72.4,2005
1,1,Harvard University,United States of America,99.7,72.4,98.7,98.8,34.5,96.1,"20,152",...,1,1,100.0,100.0,100.0,100.0,100.0,100.0,73.6,2006
2,1,Harvard University,United States of America,99.7,72.4,98.7,98.8,34.5,96.1,"20,152",...,1,1,100.0,100.0,100.0,100.0,100.0,100.0,73.0,2007
3,1,Harvard University,United States of America,99.7,72.4,98.7,98.8,34.5,96.1,"20,152",...,1,1,100.0,100.0,100.0,100.0,100.0,100.0,74.1,2008
4,1,Harvard University,United States of America,99.7,72.4,98.7,98.8,34.5,96.1,"20,152",...,1,1,100.0,100.0,100.0,100.0,100.0,100.0,74.8,2009
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
13531,601-800,Texas Tech University,United States of America,27.9,36.8,17.2,22.0,NaN,-,"29,512",...,303-401,113-138,NaN,0.0,0.0,10.3,6.1,29.8,13.9,2009
13532,601-800,Texas Tech University,United States of America,27.9,36.8,17.2,22.0,NaN,-,"29,512",...,301-400,112-137,NaN,0.0,0.0,10.2,6.6,30.6,14.5,2010
13533,601-800,Texas Tech University,United States of America,27.9,36.8,17.2,22.0,NaN,-,"29,512",...,401-500,138-151,NaN,0.0,0.0,10.2,4.7,30.3,13.7,2011
13534,601-800,Texas Tech University,United States of America,27.9,36.8,17.2,22.0,NaN,-,"29,512",...,401-500,126-146,NaN,0.0,0.0,5.1,3.3,31.6,15.1,2015
13535,601-800,Tokyo University of Science,Japan,23.0,15.4,24.1,21.4,37.6,-,"20,243",...,401-500,15-19,NaN,0.0,0.0,7.1,8.4,22.9,16.3,2014

In [100]:
tab_merge.columns

Index(['world_rank_x', 'university_name', 'country_x', 'teaching',
       'international', 'research', 'citations_x', 'income', 'total_score_x',
       'num_students', 'student_staff_ratio', 'international_students',
       'female_male_ratio', 'year_x', 'world_rank_y', 'national_rank_x',
       'total_score_y', 'alumni', 'award', 'hici', 'ns', 'pub', 'pcp',
       'year_y', 'world_rank', 'institution', 'country_y', 'national_rank_y',
       'quality_of_education', 'alumni_employment', 'quality_of_faculty',
       'publications', 'influence', 'citations_y', 'broad_impact', 'patents',
       'score', 'year'],
      dtype='object')

In [102]:
tab_merge.groupby('university_name')[]

In [109]:
tabella_merge=pd.merge(school_and_country, shanghaiData, left_on='school_name', right_on='university_name', how='left')
tabella_merge

,school_name,country,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year
0,Harvard University,United States of America,1,Harvard University,1,100.0,100.0,100.0,100.0,100.0,100.0,72.4,2005.0
1,Harvard University,United States of America,1,Harvard University,1,100.0,100.0,100.0,100.0,100.0,100.0,73.6,2006.0
2,Harvard University,United States of America,1,Harvard University,1,100.0,100.0,100.0,100.0,100.0,100.0,73.0,2007.0
3,Harvard University,United States of America,1,Harvard University,1,100.0,100.0,100.0,100.0,100.0,100.0,74.1,2008.0
4,Harvard University,United States of America,1,Harvard University,1,100.0,100.0,100.0,100.0,100.0,100.0,74.8,2009.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
3443,Xidian University,China,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3444,Yeungnam University,South Korea,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3445,Yıldız Technical University,Turkey,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3446,Yokohama City University,Japan,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3447,Yokohama National University,Japan,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [110]:
tabella_merge.loc[tabella_merge['university_name'].isnull()]

,school_name,country,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year
22,Massachusetts Institute of Technology,United States of America,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
77,Imperial College London,United Kingdom,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
123,ETH Zurich – Swiss Federal Institute of Techno...,Switzerland,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
124,University of Michigan,United States of America,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
169,University of Hong Kong,Hong Kong,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
3443,Xidian University,China,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3444,Yeungnam University,South Korea,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3445,Yıldız Technical University,Turkey,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3446,Yokohama City University,Japan,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3447,Yokohama National University,Japan,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [111]:
tabella_merge2=pd.merge(school_and_country, timesData, left_on='school_name', right_on='university_name', how='left')
tabella_merge2

,school_name,country_x,world_rank,university_name,country_y,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
0,Harvard University,United States of America,1,Harvard University,United States of America,99.7,72.4,98.7,98.8,34.5,96.1,"20,152",8.9,25%,NaN,2011
1,Harvard University,United States of America,2,Harvard University,United States of America,95.8,67.5,97.4,99.8,35.9,93.9,"20,152",8.9,25%,NaN,2012
2,Harvard University,United States of America,4,Harvard University,United States of America,94.9,63.7,98.6,99.2,39.9,93.6,"20,152",8.9,25%,NaN,2013
3,Harvard University,United States of America,2,Harvard University,United States of America,95.3,66.2,98.5,99.1,40.6,93.9,"20,152",8.9,25%,NaN,2014
4,Harvard University,United States of America,2,Harvard University,United States of America,92.9,67.6,98.6,98.9,44.0,93.3,"20,152",8.9,25%,NaN,2015
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2598,Xidian University,China,601-800,Xidian University,China,17.9,12.8,12.1,8.9,83.7,-,"31,618",16.4,2%,29 : 71,2016
2599,Yeungnam University,South Korea,601-800,Yeungnam University,South Korea,18.6,24.3,10.9,26.5,35.4,-,"21,958",15.3,3%,48 : 52,2016
2600,Yıldız Technical University,Turkey,601-800,Yıldız Technical University,Turkey,14.5,14.9,7.6,19.3,44.0,-,"31,268",28.7,2%,36 : 64,2016
2601,Yokohama City University,Japan,601-800,Yokohama City University,Japan,24.0,16.1,10.2,36.4,37.9,-,"4,122",3.7,3%,NaN,2016
2602,Yokohama National University,Japan,601-800,Yokohama National University,Japan,20.1,23.3,16.0,13.5,40.4,-,"10,117",12.1,8%,28 : 72,2016

In [114]:
tabella_merge3=pd.merge(tabella_merge, cwurData, left_on='school_name', right_on='institution', how='left')
tabella_merge3

,school_name,country_x,world_rank_x,university_name,national_rank_x,total_score,alumni,award,hici,ns,...,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year_y
0,Harvard University,United States of America,1,Harvard University,1,100.0,100.0,100.0,100.0,100.0,...,7.0,9.0,1.0,1.0,1.0,1.0,NaN,5.0,100.00,2012.0
1,Harvard University,United States of America,1,Harvard University,1,100.0,100.0,100.0,100.0,100.0,...,1.0,1.0,1.0,1.0,1.0,1.0,NaN,7.0,100.00,2013.0
2,Harvard University,United States of America,1,Harvard University,1,100.0,100.0,100.0,100.0,100.0,...,1.0,1.0,1.0,1.0,1.0,1.0,1.0,2.0,100.00,2014.0
3,Harvard University,United States of America,1,Harvard University,1,100.0,100.0,100.0,100.0,100.0,...,1.0,1.0,1.0,1.0,1.0,1.0,1.0,3.0,100.00,2015.0
4,Harvard University,United States of America,1,Harvard University,1,100.0,100.0,100.0,100.0,100.0,...,7.0,9.0,1.0,1.0,1.0,1.0,NaN,5.0,100.00,2012.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7817,Yıldız Technical University,Turkey,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7818,Yokohama City University,Japan,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,355.0,196.0,210.0,650.0,362.0,800.0,460.0,338.0,45.26,2014.0
7819,Yokohama City University,Japan,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,367.0,231.0,218.0,685.0,370.0,645.0,520.0,359.0,44.73,2015.0
7820,Yokohama National University,Japan,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,52.0,135.0,126.0,841.0,812.0,609.0,749.0,338.0,45.97,2014.0
7821,Yokohama National University,Japan,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,88.0,217.0,135.0,909.0,865.0,645.0,809.0,440.0,44.72,2015.0

In [117]:
tabella_merge3.columns

Index(['school_name', 'country_x', 'world_rank_x', 'university_name',
       'national_rank_x', 'total_score', 'alumni', 'award', 'hici', 'ns',
       'pub', 'pcp', 'year_x', 'world_rank_y', 'institution', 'country_y',
       'national_rank_y', 'quality_of_education', 'alumni_employment',
       'quality_of_faculty', 'publications', 'influence', 'citations',
       'broad_impact', 'patents', 'score', 'year_y'],
      dtype='object')

In [127]:
punto10=tabella_merge3.loc[(tabella_merge3['institution'].isnull())|(tabella_merge3['university_name'].isnull())][['university_name','institution','school_name']]

punto10

,university_name,institution,school_name
88,NaN,Massachusetts Institute of Technology,Massachusetts Institute of Technology
89,NaN,Massachusetts Institute of Technology,Massachusetts Institute of Technology
90,NaN,Massachusetts Institute of Technology,Massachusetts Institute of Technology
91,NaN,Massachusetts Institute of Technology,Massachusetts Institute of Technology
308,NaN,Imperial College London,Imperial College London
...,...,...,...
7817,NaN,NaN,Yıldız Technical University
7818,NaN,Yokohama City University,Yokohama City University
7819,NaN,Yokohama City University,Yokohama City University
7820,NaN,Yokohama National University,Yokohama National University
7821,NaN,Yokohama National University,Yokohama National University

In [150]:
#pd.punto10(['school_name'], index=False).unique()
pd.unique(punto10['school_name'])
#punto10.['school_name'].unique

array(['Massachusetts Institute of Technology', 'Imperial College London',
       'ETH Zurich – Swiss Federal Institute of Technology Zurich',
       'University of Michigan', 'University of Hong Kong',
       'University of Washington', 'University of Tokyo',
       'University of Illinois at Urbana-Champaign',
       'Washington University in St Louis', 'École Polytechnique',
       'University of Edinburgh',
       'Hong Kong University of Science and Technology',
       'École Normale Supérieure', 'Australian National University',
       'University of Göttingen', 'University of Wisconsin',
       'École Polytechnique Fédérale de Lausanne',
       'University of Minnesota', 'University of Massachusetts',
       'LMU Munich', 'University of Pittsburgh', 'Ohio State University',
       'University of Colorado Boulder', 'University of Adelaide',
       'William & Mary', 'Trinity College Dublin',
       'King’s College London',
       'Korea Advanced Institute of Science and Technology (KAIST)',
       'The University of Queensland', 'Heidelberg University',
       'London School of Economics and Political Science',
       'University of Manchester', 'Royal Holloway, University of London',
       'George Washington University', 'École Normale Supérieure de Lyon',
       'Technical University of Munich',
       'Rutgers, the State University of New Jersey', 'Purdue University',
       'Pennsylvania State University', 'Hong Kong Baptist University',
       'Bilkent University', 'University of Hawai’i at Mānoa',
       'KU Leuven', 'University of Glasgow', 'University of Freiburg',
       'University of Sheffield', 'Pierre and Marie Curie University',
       'University of Dundee',
       'Wageningen University and Research Center',
       'University of Auckland', 'Alexandria University',
       'Hong Kong Polytechnic University', 'Indiana University',
       'Georgia Health Sciences University',
       'Erasmus University Rotterdam', 'National Sun Yat-Sen University',
       'University of Würzburg', 'Goethe University Frankfurt',
       'Humboldt University of Berlin',
       'Middle East Technical University',
       'Karlsruhe Institute of Technology', 'University of Tübingen',
       'KTH Royal Institute of Technology',
       'University of Wisconsin-Madison', 'University of Texas at Austin',
       'Hebrew University of Jerusalem',
       'Chinese University of Hong Kong', 'Free University of Berlin',
       'Texas A&M University', 'University of Reading',
       'Paris Diderot University – Paris 7',
       'Université Catholique de Louvain', 'Queen’s University',
       'University of São Paulo', 'University of Western Australia',
       'Colorado School of Mines',
       'Technion Israel Institute of Technology', 'Ulm University',
       'Umeå University', 'University at Buffalo',
       'University of Georgia',
       'University of Medicine and Dentistry of New Jersey',
       'University of South Carolina', 'University of Western Ontario',
       'Université Libre de Bruxelles', 'Colorado State University',
       'Creighton University', 'State University of New York Albany',
       'University of Calgary', 'University of Milan-Bicocca',
       'University of Missouri', 'Brunel University London',
       'Johannes Kepler University of Linz', 'Queen’s University Belfast',
       'Ruhr University Bochum', 'TU Dresden',
       'University of Texas at Dallas', 'Aberystwyth University',
       'Istanbul Technical University',
       'Lomonosov Moscow State University', 'Montpellier University',
       'State University of Campinas',
       'Technical University of Darmstadt',
       'Tokyo Medical and Dental University (TMDU)',
       'UiT The Arctic University of Norway', 'University of Crete',
       'University of Iceland', 'University of Münster',
       'University of Texas at San Antonio', 'University of Trento',
       'Binghamton University, State University of New York',
       'Boğaziçi University', 'Charles Darwin University',
       'Indian Institute of Technology Bombay', 'Keele University',
       'Linköping University',
       'National Taiwan University of Science and Technology (Taiwan Tech)',
       'Plymouth University', 'Polytechnic University of Milan',
       'Sungkyunkwan University (SKKU)', 'University of Aveiro',
       'University of Hull', 'University of Liège',
       'University of Modena and Reggio Emilia', 'University of Oklahoma',
       'University of South Florida', 'University of Stirling',
       'University of Tampere', 'University of Waikato',
       'Vrije Universiteit Brussel', 'Washington State University',
       'Aston University', 'Georgia State University',
       'Heriot-Watt University', 'Leibniz University of Hanover',
       'Liverpool John Moores University', 'Mahidol University',
       'National Taiwan Ocean University',
       'National University of Ireland, Galway',
       'National University of Ireland, Maynooth',
       'New University of Lisbon',
       'Pontifical Catholic University of Chile', 'Swansea University',
       'University of Bari Aldo Moro', 'University of Kent',
       'University of Paris North – Paris 13', 'University of Salento',
       'University of South Australia', 'University of Tartu',
       'Yuan Ze University', 'Paris-Sud University',
       'Joseph Fourier University',
       'Johannes Gutenberg University of Mainz',
       'St George’s, University of London',
       'Florida Institute of Technology', 'Koç University',
       'Mines ParisTech', 'National Research Nuclear University MePhI',
       'Bayreuth University', 'University of Montana',
       'North Carolina State University', 'Renmin University of China',
       'University of Portsmouth',
       'Indian Institute of Technology Roorkee',
       'King Mongkut’s University of Technology Thonburi',
       'Paris Dauphine University', 'University of Jyväskylä',
       'University of Minho', 'University of Technology Sydney',
       'University of the Andes, Colombia', 'Panjab University',
       'University of Cologne', 'University of Nebraska-Lincoln',
       'University of Alaska Fairbanks', 'Wuhan University of Technology',
       'China Medical University, Taiwan',
       'Indian Institute of Technology Delhi',
       'Indian Institute of Technology Kanpur', 'University of Navarra',
       'University of Rovira i Virgili',
       'Scuola Normale Superiore di Pisa', 'Sabancı University',
       'Federico Santa María Technical University',
       'University of New Mexico',
       'Lappeenranta University of Technology', 'University of Macau',
       'Illinois Institute of Technology', 'Novosibirsk State University',
       'University of Marrakech Cadi Ayyad',
       'Isfahan University of Technology',
       'Royal College of Surgeons in Ireland', 'University of Rome III',
       'University of Seoul', 'Western Sydney University',
       'University of Mannheim', 'Scuola Superiore Sant’Anna',
       'University of Luxembourg', 'Charité - Universitätsmedizin Berlin',
       'Copenhagen Business School',
       'Oregon Health and Science University',
       'Paris Descartes University',
       'Peter the Great St Petersburg Polytechnic University',
       'Royal Veterinary College', 'Justus Liebig University Giessen',
       'University of Tennessee, Knoxville',
       'Tomsk Polytechnic University',
       'Gwangju Institute of Science and Technology',
       'University of Hohenheim', 'Kazan Federal University',
       'Örebro University', 'Technical University of Dortmund',
       'Toulouse 1 Capitole University',
       'VŠB - Technical University of Ostrava', 'University of Cyprus',
       'University of St Gallen', 'Graz University of Technology',
       'Instituto Superior Técnico Lisboa',
       'Panthéon-Sorbonne University – Paris 1',
       'University of South Dakota',
       'Lille 2 University – Health and Law', 'Verona University',
       'American University', 'Bournemouth University',
       'University of Brescia', 'Brno University of Technology',
       'Ca’ Foscari University of Venice', 'City University London',
       'Dublin City University', 'Indian Institute of Technology Madras',
       'University of Ioannina',
       'Iran University of Science and Technology',
       'University of Kaiserslautern', 'Louisiana State University',
       'Makerere University', 'Marche Polytechnic University',
       'University of Nantes',
       'National Institute of Applied Sciences of Lyon (INSA Lyon)',
       'National Yang-Ming University', 'University of Neuchâtel',
       'The Open University', 'Oxford Brookes University',
       'RMIT University', 'University of Rome II – Tor Vergata',
       'University of San Francisco', 'Southern Cross University',
       'Tampere University of Technology', 'University of Ulsan',
       'Ulster University', 'Université du Québec à Montréal',
       'Universiti Teknologi Malaysia', 'University of Urbino Carlo Bo',
       'American University of Beirut',
       'Amirkabir University of Technology', 'University of Arkansas',
       'Babeş-Bolyai University',
       'Bauman Moscow State Technical University',
       'Blaise Pascal University', 'University of Burgundy',
       'University of Canberra', 'University of Catania',
       'Central Queensland University', 'Chung-Ang University',
       'Czech Technical University in Prague', 'De Montfort University',
       'East China Normal University', 'Edith Cowan University',
       'Indian Institute of Technology Guwahati', 'Jadavpur University',
       'King Fahd University of Petroleum and Minerals',
       'University of La Laguna', 'University of Limerick',
       'Manchester Metropolitan University', 'University of Maribor',
       'Masaryk University',
       'Missouri University of Science and Technology',
       'Montana State University',
       'Monterrey Institute of Technology and Higher Education',
       'National Taiwan Normal University',
       'National Technical University of Athens',
       'University of North Carolina at Greensboro',
       'Oklahoma State University',
       'Otto von Guericke University of Magdeburg',
       'University of Oviedo', 'Palacký University in Olomouc',
       'Pontifical Catholic University of Rio de Janeiro (PUC-Rio)',
       'Quaid-i-azam University', 'University of Regina',
       'University of Salamanca', 'University of Santiago de Compostela',
       'Semmelweis University', 'Université de Sherbrooke',
       'Soochow University', 'Tallinn University of Technology',
       'Tehran University of Medical Sciences',
       'University of Texas at Arlington', 'University of Toledo',
       'University of Tulsa', 'United Arab Emirates University',
       'University of Wisconsin-Milwaukee', 'Xi’an Jiaotong University',
       'University of A Coruña', 'Adam Mickiewicz University',
       'AGH University of Science and Technology', 'Ajou University',
       'University of Alcalá', 'Alexandru Ioan Cuza University',
       'Aligarh Muslim University', 'American University of Sharjah',
       'Amrita University', 'Anadolu University', 'Andhra University',
       'University of Antioquia', 'Asia University, Taiwan',
       'Athens University of Economics and Business',
       'Auckland University of Technology', 'Austral University of Chile',
       'Beijing Institute of Technology', 'Belarusian State University',
       'Birla Institute of Technology and Science, Pilani',
       'University of Brasília', 'University of Brighton',
       'University of Bucharest',
       'Budapest University of Technology and Economics',
       'California State University, Long Beach',
       'University of Castilla-La Mancha',
       'University of Central Lancashire', 'University of Cergy-Pontoise',
       'Carlos III University of Madrid',
       'University of Chemistry and Technology, Prague',
       'Chiang Mai University', 'China University of Geosciences (Wuhan)',
       'China University of Petroleum (Beijing)',
       'Chonbuk National University', 'Chongqing University',
       'Chonnam National University', 'Chulalongkorn University',
       'Chung Yuan Christian University',
       'Comenius University in Bratislava', 'Coventry University',
       'University of Debrecen', 'University of Delhi',
       'University of Dhaka', 'Dublin Institute of Technology',
       'University of Electronic Science and Technology of China',
       'Eötvös Loránd University', 'Erciyes University',
       'Federal University of Bahia',
       'Federal University of Paraná (UFPR)',
       'Federal University of Santa Catarina',
       'Federal University of São Carlos', 'Federal University of Viçosa',
       'Federal University of Lavras', 'Feng Chia University',
       'Fu Jen Catholic University', 'Gdańsk University of Technology',
       'University of Ghana', 'Glasgow Caledonian University',
       'University of Greenwich', 'University of Huddersfield',
       'Hunan University', 'University of Ibadan',
       'University of Indonesia', 'Inha University', 'I-Shou University',
       'University of Jordan',
       'Jordan University of Science and Technology',
       'K.N. Toosi University of Technology',
       'Kaohsiung Medical University', 'Khon Kaen University',
       'Kingston University', 'Kinki University', 'Konkuk University',
       'Kyushu Institute of Technology', 'University of Latvia',
       'Lille 1 University – Science and Technology',
       'University of Lincoln', 'Miami University',
       'Middlesex University',
       'Moscow Institute of Physics and Technology',
       'University of Murcia', 'University of Nairobi',
       'National Chengchi University', 'National Chung Cheng University',
       'National Chung Hsing University',
       'National Taipei University of Technology',
       'National University of Córdoba',
       'National University of Science and Technology (MISiS)',
       'National University of Sciences and Technology',
       'Northumbria University', 'Northwestern Polytechnical University',
       'Nottingham Trent University', 'Oakland University',
       'Ocean University of China', 'University of Pardubice',
       'Paris-Sorbonne University – Paris 4', 'University of Patras',
       'University of Pécs', 'Pontifical Catholic University of Paraná',
       'Pontifical Catholic University of Rio Grande do Sul (PUCRS)',
       'Pontifical Catholic University of Valparaíso',
       'Prince of Songkla University', 'Qatar University',
       'Rio de Janeiro State University (UERJ)',
       'Rochester Institute of Technology', 'Saitama University',
       'University of Salford', 'University of Santiago, Chile (USACH)',
       'São Paulo State University (UNESP)',
       'Savitribai Phule Pune University',
       'University of Science and Technology Beijing',
       'Sejong University', 'Shahid Beheshti University',
       'Shanghai University', 'Shantou University',
       'Sheffield Hallam University', 'Shinshu University',
       'Showa University', 'University of Silesia in Katowice',
       'Slovak University of Technology in Bratislava',
       'Sogang University', 'Sophia University',
       'University of South Africa', 'Southern Federal University',
       'University of Southern Mississippi',
       'University of Southern Queensland', 'Suez Canal University',
       'Sultan Qaboos University', 'Suranaree University of Technology',
       'Taipei Medical University',
       'Taras Shevchenko National University of Kyiv',
       'Technical University of Madrid', 'University of Texas at El Paso',
       'Texas Tech University', 'Tokai University',
       'Tokushima University',
       'Tokyo University of Marine Science and Technology',
       'Tomsk State University', 'Tottori University',
       'Toyohashi University of Technology',
       'Universiti Kebangsaan Malaysia', 'Universiti Putra Malaysia',
       'Universiti Sains Malaysia', 'Universiti Teknologi MARA',
       'Ural Federal University',
       'V.N. Karazin Kharkiv National University', 'Vilnius University',
       'Warsaw University of Technology', 'University of West Bohemia',
       'University of the West of England',
       'West University of Timişoara', 'University of Westminster',
       'Xidian University', 'Yeungnam University',
       'Yıldız Technical University', 'Yokohama City University',
       'Yokohama National University'], dtype=object)

11. In the times ranking, compute the number of times each university appears

12. Find the universities that appear at most twice in the times ranking.

13. The universities that, in any year, have the same position in all three rankings (they must have the same position in a year).

4-10-11-12-13